In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('empleados.csv', delimiter=";")

In [3]:
df.head()

,Nombre,Sexo,Estado_Civil,Edad,Experiencia,Salario,Gerencia,Departamento
0,Alexandro,Masculino,Soltero(a),22.0,3,2423,No,Publicidad
1,Felipa,Femenino,Soltero(a),26.0,5,2639,No,Comercial
2,Daniel,Masculino,Casado(a),35.0,10,3122,No,Comercial
3,John,Masculino,Casado(a),35.0,13,3431,Sí,Servicios al cliente
4,Ruperta,Femenino,Casado(a),54.0,18,3962,No,Producto

In [4]:
df.isnull().sum()

Nombre           0
Sexo             0
Estado_Civil     0
Edad            46
Experiencia      0
Salario          0
Gerencia         0
Departamento     0
dtype: int64

In [5]:
df['Edad'].mean()

33.86896551724138

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 191 entries, 0 to 190
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Nombre        191 non-null    object
 1   Sexo          191 non-null    object
 2   Estado_Civil  191 non-null    object
 3   Edad          145 non-null    float64
 4   Experiencia   191 non-null    int64
 5   Salario       191 non-null    int64
 6   Gerencia      191 non-null    object
 7   Departamento  191 non-null    object
dtypes: float64(1), int64(2), object(5)
memory usage: 12.1+ KB

In [8]:
df['Edad'].fillna(inplace=True, value=df['Edad'].mean())

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 191 entries, 0 to 190
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Nombre        191 non-null    object
 1   Sexo          191 non-null    object
 2   Estado_Civil  191 non-null    object
 3   Edad          191 non-null    float64
 4   Experiencia   191 non-null    int64
 5   Salario       191 non-null    int64
 6   Gerencia      191 non-null    object
 7   Departamento  191 non-null    object
dtypes: float64(1), int64(2), object(5)
memory usage: 12.1+ KB

In [11]:
df.head()

,Nombre,Sexo,Estado_Civil,Edad,Experiencia,Salario,Gerencia,Departamento
0,Alexandro,Masculino,Soltero(a),22.0,3,2423,No,Publicidad
1,Felipa,Femenino,Soltero(a),26.0,5,2639,No,Comercial
2,Daniel,Masculino,Casado(a),35.0,10,3122,No,Comercial
3,John,Masculino,Casado(a),35.0,13,3431,Sí,Servicios al cliente
4,Ruperta,Femenino,Casado(a),54.0,18,3962,No,Producto

In [12]:
df.isnull().sum()

Nombre          0
Sexo            0
Estado_Civil    0
Edad            0
Experiencia     0
Salario         0
Gerencia        0
Departamento    0
dtype: int64